#  `college` dataset 02.ipynb

In [1]:
import numpy as np
import os

os.getcwd() # get current working directory

'/Users/dby/Desktop/DS_Projects/ds-intro-class-2022/pandas_intro'

In [2]:
import pandas as pd
pd.set_option('display.max_columns', 100)

college = pd.read_csv('data/college.csv')

In [3]:
college.head()

,instnm,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [4]:
college.shape

(7535, 27)

In [5]:
college.dtypes

instnm                 object
city                   object
stabbr                 object
hbcu                  float64
menonly               float64
womenonly             float64
relaffil                int64
satvrmid              float64
satmtmid              float64
distanceonly          float64
ugds                  float64
ugds_white            float64
ugds_black            float64
ugds_hisp             float64
ugds_asian            float64
ugds_aian             float64
ugds_nhpi             float64
ugds_2mor             float64
ugds_nra              float64
ugds_unkn             float64
pptug_ef              float64
curroper                int64
pctpell               float64
pctfloan              float64
ug25abv               float64
md_earn_wne_p10        object
grad_debt_mdn_supp     object
dtype: object

## Exercise 1: What is the median SAT Math score (satmtmid) for The University of Texas at Dallas?

In [6]:
# select rows with condition UT Dallas
UT_DALLAS = college.loc[college['instnm']=='The University of Texas at Dallas']
UT_DALLAS['satmtmid']

#college.loc[college['instnm']=='The University of Texas at Dallas']['satmtmid']

3768    645.0
Name: satmtmid, dtype: float64

## Exercise 2: What state (stabbr) has the 5th highest total undergraduate population (ugds) and what is that population?

In [7]:
# group by state and calculate total undergraduate population for each state and select 5th highest 
tot_ugds_by_state = college.groupby('stabbr')['ugds'].sum().sort_values(ascending=False) # get total ugds by state
population_5th = tot_ugds_by_state[4]
state_5th = tot_ugds_by_state.index.tolist()[4] # list state
print(f'Population 5th highest ugds state is {state_5th} with {population_5th}')

# tot_ugds_by_state

Population 5th highest ugds state is PA with 604942.0

## Answer EX 1&2

In [8]:
# 1
college.loc[college['instnm'].str.contains('University of Texas'), 'instnm']
college.loc[college['instnm']=='The University of Texas at Dallas', 'satmtmid']

# 2
total_udgs = college.groupby('stabbr')['ugds'].sum()
total_udgs.nlargest(5).tail(1)

stabbr
PA    604942.0
Name: ugds, dtype: float64

## Exercise 3: Which columns in  `college` dataset contain missing value? What are their missing rate(%)?

In [9]:
college.isna().sum() # tally missing values
college.isna().sum()*100/college.shape[0] # missing rate

instnm                 0.000000
city                   0.000000
stabbr                 0.000000
hbcu                   4.923689
menonly                4.923689
womenonly              4.923689
relaffil               0.000000
satvrmid              84.273391
satmtmid              84.127405
distanceonly           4.923689
ugds                   8.772395
ugds_white             8.772395
ugds_black             8.772395
ugds_hisp              8.772395
ugds_asian             8.772395
ugds_aian              8.772395
ugds_nhpi              8.772395
ugds_2mor              8.772395
ugds_nra               8.772395
ugds_unkn              8.772395
pptug_ef               9.051095
curroper               0.000000
pctpell                9.104180
pctfloan               9.104180
ug25abv               10.842734
md_earn_wne_p10       14.890511
grad_debt_mdn_supp     0.424685
dtype: float64

## Exercise 4: Is there statistical significant difference between average `md_earn_wne_p10` (Median Earnings 10 years after enrollment) for schools in Texas and California? 

Hint: we can see this problem as a [two-sample t-test](https://online.stat.psu.edu/stat555/node/36/)

you might find the following function useful to converts data to numeric: `pd.to_numeric()`

example code for p-value calculation if you'd like to calculate z-scores: `import scipy.stats as st`, `st.norm.cdf(-1.506666)`

you may also find the following function useful: `st.ttest_ind()`

[Python for Data Analysis: Hypothesis Testing and T-Tests](https://www.youtube.com/watch?v=CIbJSX-biu0&ab_channel=DataDaft)

In [10]:
college['stabbr'].unique()

array(['AL', 'IL', 'AK', 'AZ', 'NM', 'AR', 'CA', 'MN', 'CO', 'CT', 'NY',
       'DE', 'DC', 'VA', 'FL', 'GA', 'HI', 'ID', 'IN', 'TN', 'MI', 'IA',
       'KS', 'MO', 'KY', 'LA', 'ME', 'MD', 'MA', 'MS', 'MT', 'NE', 'NV',
       'NH', 'NJ', 'NC', 'ND', 'OH', 'WV', 'OK', 'OR', 'PA', 'RI', 'SC',
       'SD', 'TX', 'UT', 'VT', 'WA', 'WI', 'WY', 'AS', 'GU', 'MP', 'PR',
       'FM', 'PW', 'VI', 'MH'], dtype=object)

In [11]:
# college['md_earn_wne_p10'].unique()

In [12]:
# md_earn_wne_p10
# percent privacy suppressed
print(len(college[college['md_earn_wne_p10'] == 'PrivacySuppressed'])/college.shape[0]) 
# percent NaN
print(len(college[college['md_earn_wne_p10'].isna()])/college.shape[0])

# percent that has no data (na or string)
print((len(college[college['md_earn_wne_p10'] == 'PrivacySuppressed'])+len(college[college['md_earn_wne_p10'].isna()]))/college.shape[0])
# percent has usable data
print(1-(len(college[college['md_earn_wne_p10'] == 'PrivacySuppressed'])+len(college[college['md_earn_wne_p10'].isna()]))/college.shape[0])

0.10909090909090909
0.14890510948905109
0.2579960185799602
0.7420039814200399

In [13]:
sub_wo_str_md_earn = college[college['md_earn_wne_p10'] != 'PrivacySuppressed']
# sanity check = percent has usable data?
sub_wo_str_md_earn[sub_wo_str_md_earn['md_earn_wne_p10'].notna()].shape[0]/college.shape[0]

# final usable dataset without strings and nan
ex4 = sub_wo_str_md_earn[sub_wo_str_md_earn['md_earn_wne_p10'].notna()]

In [14]:
CA_ex4 = ex4[ex4['stabbr']=='CA']
TX_ex4 = ex4[ex4['stabbr']=='TX']

CA_ex4_md_earn = pd.to_numeric(CA_ex4['md_earn_wne_p10'])
TX_ex4_md_earn = pd.to_numeric(TX_ex4['md_earn_wne_p10'])

In [15]:
print(f'CA avg md_earn_wne_p10: {CA_ex4_md_earn.mean()}')
print(f'TX avg md_earn_wne_p10: {TX_ex4_md_earn.mean()}')

CA avg md_earn_wne_p10: 33698.81422924901
TX avg md_earn_wne_p10: 31004.802259887005

In [16]:
import scipy.stats as st

st.ttest_ind(a=CA_ex4_md_earn, b=TX_ex4_md_earn, equal_var=True)

Ttest_indResult(statistic=2.5022640635179707, pvalue=0.012525260338027689)

No statistical significance

# HW3

## Exercise 5 . Find the mean and standard deviation of math and verbal SAT score for men-only, women-only, and non gender specific universities. (`college`)

In [17]:
college.head()
#college['menonly'].unique()
#college['womenonly'].unique()

men_college = college[college['menonly']==1]
women_college = college[college['womenonly']==1]
non_gender_college = college[(college['menonly']==0) & (college['womenonly']==0)]

In [18]:
print(f'Men-only college verbal SAT mean: {men_college["satvrmid"].mean()}')
print(f'Women-only college verbal SAT mean: {women_college["satvrmid"].mean()}')
print(f'non gender specific college verbal SAT mean: {non_gender_college["satvrmid"].mean()}\n\n')

print(f'Men-only college verbal SAT standard deviation: {men_college["satvrmid"].std()}')
print(f'Women-only college verbal SAT standard deviation: {women_college["satvrmid"].std()}')
print(f'non gender specific college verbal SAT standard deviation: {non_gender_college["satvrmid"].std()}\n\n')

print(f'Men-only college math SAT mean: {men_college["satmtmid"].mean()}')
print(f'Women-only college math SAT mean: {women_college["satmtmid"].mean()}')
print(f'non gender specific college math SAT mean: {non_gender_college["satmtmid"].mean()}\n\n')

print(f'Men-only college math SAT standard deviation: {men_college["satmtmid"].std()}')
print(f'Women-only college math SAT standard deviation: {women_college["satmtmid"].std()}')
print(f'non gender specific college math SAT standard deviation: {non_gender_college["satmtmid"].std()}')

Men-only college verbal SAT mean: 558.0
Women-only college verbal SAT mean: 548.4
non gender specific college verbal SAT mean: 522.1134199134199


Men-only college verbal SAT standard deviation: 52.49761899362675
Women-only college verbal SAT standard deviation: 70.65703550720669
non gender specific college verbal SAT standard deviation: 68.49748026328294


Men-only college math SAT mean: 566.4
Women-only college math SAT mean: 531.32
non gender specific college math SAT mean: 530.6003430531732


Men-only college math SAT standard deviation: 56.88848741177779
Women-only college math SAT standard deviation: 71.7093206401139
non gender specific college math SAT standard deviation: 73.58176532758233

## Exercise 6. Find the top 3 universities with largest numbers of undergraduate students for each state

In [19]:
college_copy = college.copy()
college_copy = college_copy.set_index('instnm')
top_3_state= college_copy.groupby('stabbr')['ugds'].nlargest(3).to_frame().reset_index().set_index('stabbr')
top_3_state.loc['MA'] # locate any state
# top_3_state

                                     instnm     ugds
stabbr
MA      University of Massachusetts-Amherst  21864.0
MA                        Boston University  16457.0
MA                  Northeastern University  13492.0

## Using `emp.csv` for the following questions:
### Exercise 7. Generate a DataFrame for the ratios of (number of employees of specific gender and race/total number of employees) for all race-gender combinations.

In [20]:
emp = pd.read_csv('data/employee.csv')
emp.head()

,title,dept,salary,race,gender,hire_date
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male,2015-02-03
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male,1982-02-08
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male,1984-11-26
3,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male,2012-03-26
4,CARPENTER,Houston Airport System (HAS),42390.0,White,Male,2013-11-04

In [21]:
emp.shape # 1653 employees ttl

(1653, 6)

In [22]:
emp.isna().sum()

title          0
dept           0
salary       102
race          20
gender         0
hire_date      0
dtype: int64

In [23]:
emp_noNaN = emp.replace(np.nan,'Non_specified')
emp_noNaN['race'].unique()

array(['White', 'Black', 'Asian', 'Non_specified', 'Hispanic',
       'Native American'], dtype=object)

In [24]:
emp_noNaN.groupby(['race','gender'])['gender'].count()*100/emp_noNaN.shape[0]
emp_gender_race = (emp_noNaN.groupby(['race','gender'])['gender'].count()*100/emp_noNaN.shape[0]).to_frame()
emp_gender_race = emp_gender_race.rename(columns={"gender": "Population Proportion Over Total"})
emp_gender_race

                        Population Proportion Over Total
race            gender
Asian           Female                          1.088929
                Male                            4.234725
Black           Female                         13.067151
                Male                           19.721718
Hispanic        Female                          6.110103
                Male                           17.785844
Native American Female                          0.241984
                Male                            0.241984
Non_specified   Female                          0.483969
                Male                            0.725953
White           Female                          4.718693
                Male                           31.578947

### Exercise 8. Use `pd.melt()` to unpivot table `pv3` to the format of `pv4` in example above.
Result: pv5

In [25]:
pv2 = emp.pivot_table(index='gender', columns='race', 
                      values='salary', aggfunc='mean').round(-3)
pv3 = pv2.reset_index()
pv3

race  gender    Asian    Black  Hispanic  Native American    White
0     Female  58000.0  48000.0   44000.0          59000.0  66000.0
1       Male  61000.0  52000.0   55000.0          69000.0  63000.0

In [26]:
pv4 = pv2.stack().reset_index()
pv4

   gender             race        0
0  Female            Asian  58000.0
1  Female            Black  48000.0
2  Female         Hispanic  44000.0
3  Female  Native American  59000.0
4  Female            White  66000.0
5    Male            Asian  61000.0
6    Male            Black  52000.0
7    Male         Hispanic  55000.0
8    Male  Native American  69000.0
9    Male            White  63000.0

In [27]:
pv5 = pv3.melt(id_vars=['gender'],var_name=['race'],value_name='0').sort_values('gender').reset_index().drop(columns=['index'])
pv5

   gender             race        0
0  Female            Asian  58000.0
1  Female            Black  48000.0
2  Female         Hispanic  44000.0
3  Female  Native American  59000.0
4  Female            White  66000.0
5    Male            Asian  61000.0
6    Male            Black  52000.0
7    Male         Hispanic  55000.0
8    Male  Native American  69000.0
9    Male            White  63000.0